name: "ensemble_model"
max_batch_size: 0
platform: "ensemble"
input[
  {
    name: "TEXT",
    data_type: TYPE_STRING,
    dims: [ -1]
  }
]
output
  {
    name: "generated_indices",
    data_type: TYPE_FP32,
    dims: [-1, -1]
  }


ensemble_scheduling {
    step [
        {
            model_name: "tokenizer"
            model_version: -1
            input_map {
                key: "TEXT"
                value: "TEXT"
            }
            output_map [{
                key: "input_ids"
                value: "input_ids"
            },
            {
                key: "attention_mask"
                value: "attention_mask"
            }]},
            {
            model_name: "encoder_decoder_model"
            model_version: -1
            input_map [{
                key: "input_ids"
                value: "input_ids"
            },
            {
                key: "attention_mask"
                value: "attention_mask"
            }]
            output_map {
                key: "generated_indices"
                value: "generated_indices"
            }
            }
    ]
}
